; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v11)
             (pred_2 ?v6 ?v2)
             (pred_9 ?v8 ?v2)
             (pred_1 ?v10 ?v8 )
	     (pred_5 ?v8)
             (pred_6 ?v5)
             (pred_12 ?v6)
             (pred_7 ?v2)
             (pred_3 ?v8)
             (pred_11 ?v6)
             (pred_4 ?v8)
             (pred_8 ))



(:action op_5
:parameters (?v12 ?v4 ?v9 ?v3)
:precondition (and (pred_6 ?v12) (pred_6 ?v4) (pred_12 ?v9) (pred_7 ?v3)
          (pred_10 ?v12 ?v4) (pred_2 ?v9 ?v3)
                   (pred_9 ?v4 ?v3) (pred_5 ?v12) 
                   (pred_3 ?v4) (pred_11 ?v9))
:effect (and  (pred_4 ?v4) (not (pred_3 ?v4))))


(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_6 ?v12) (pred_6 ?v7)
               (pred_5 ?v12) (pred_10 ?v12 ?v7) (pred_4 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v12))))

(:action op_2
:parameters (?v12 ?v9)
:precondition (and (pred_6 ?v12) (pred_12 ?v9) 
                  (pred_5 ?v12) (pred_1 ?v9 ?v12) (pred_8 ))
:effect (and (pred_11 ?v9)
   (not (pred_1 ?v9 ?v12)) (not (pred_8 ))))


(:action op_4
:parameters (?v12 ?v1 ?v13)
:precondition (and (pred_6 ?v12) (pred_12 ?v1) (pred_12 ?v13)
                  (pred_5 ?v12) (pred_11 ?v13) (pred_1 ?v1 ?v12))
:effect (and (pred_11 ?v1) (pred_1 ?v13 ?v12)
        (not (pred_11 ?v13)) (not (pred_1 ?v1 ?v12))))

(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_6 ?v12) (pred_12 ?v9) 
                  (pred_5 ?v12) (pred_11 ?v9))
:effect (and (pred_8 ) (pred_1 ?v9 ?v12) (not (pred_11 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_16 obj_14 obj_20 obj_24 obj_15 obj_21 obj_17 obj_11 obj_10 obj_07 obj_23 obj_05 obj_25 obj_30 obj_02 obj_19 obj_04 obj_28 obj_26 obj_27 obj_12 obj_08 obj_03 obj_13
    obj_06 obj_09
    obj_22 obj_18 obj_29
    )

    (:init
       (pred_8)

       (pred_6 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_14)
       (pred_6 obj_20)
       (pred_6 obj_24)
       (pred_6 obj_15)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_23)
       (pred_6 obj_05)
       (pred_6 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_02)
       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_6 obj_28)
       (pred_6 obj_26)
       (pred_6 obj_27)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_13)
       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_12 obj_22)
       (pred_12 obj_18)
       (pred_12 obj_29)

       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_16 obj_01)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_20 obj_24)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_20)
       (pred_10 obj_15 obj_07)
       (pred_10 obj_15 obj_21)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_21 obj_15)
       (pred_10 obj_17 obj_05)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_20)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_10 obj_30)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_23)
       (pred_10 obj_07 obj_15)
       (pred_10 obj_23 obj_19)
       (pred_10 obj_23 obj_05)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_23 obj_07)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_25)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_05 obj_23)
       (pred_10 obj_25 obj_28)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_25 obj_05)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_30 obj_10)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_02 obj_27)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_04)
       (pred_10 obj_19 obj_23)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_28)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_04 obj_19)
       (pred_10 obj_28 obj_03)
       (pred_10 obj_28 obj_26)
       (pred_10 obj_28 obj_25)
       (pred_10 obj_28 obj_04)
       (pred_10 obj_26 obj_13)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_26 obj_28)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_27 obj_02)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_28)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_13 obj_26)
       (pred_10 obj_13 obj_03)
       (pred_3 obj_05)
       (pred_3 obj_23)
       (pred_3 obj_17)
       (pred_9  obj_05 obj_06)
       (pred_9  obj_23 obj_09)
       (pred_9  obj_17 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_20)
       (pred_4 obj_24)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_25)
       (pred_4 obj_30)
       (pred_4 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_04)
       (pred_4 obj_28)
       (pred_4 obj_26)
       (pred_4 obj_27)
       (pred_4 obj_12)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_13)

       (pred_2  obj_22 obj_06)
       (pred_2  obj_18 obj_09)
       (pred_2  obj_29 obj_06)
       (pred_1 obj_22 obj_19)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_29 obj_04)
       (pred_5 obj_10)
    )

    (:goal (and
       (pred_1 obj_29 obj_11)
    ))
(:constraints
  (always (not (pred_5 obj_28)))
)
)

; plan
1. (op_1 obj_10 obj_30)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_30)
   goals met: 0 of 1
2. (op_1 obj_30 obj_26)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_26)
   goals met: 0 of 1
3. (op_1 obj_26 obj_13)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_13)
   goals met: 0 of 1
4. (op_1 obj_13 obj_03)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_03)
   goals met: 0 of 1
5. (op_1 obj_03 obj_08)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_08)
   goals met: 0 of 1
6. (op_1 obj_08 obj_04)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_04)
   goals met: 0 of 1
7. (op_2 obj_04 obj_29)
   deleted: (pred_1 obj_29 obj_04) (pred_8)
   added: (pred_11 obj_29)
   goals met: 0 of 1
8. (op_5 obj_04 obj_05 obj_29 obj_06)
   deleted: (pred_3 obj_05)
   added: (pred_4 obj_05)
   goals met: 0 of 1
9. (op_1 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_05)
   goals met: 0 of 1
10. (op_1 obj_05 obj_25)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_25)
   goals met: 0 of 1
11. (op_1 obj_25 obj_11)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_11)
   goals met: 0 of 1
12. (op_3 obj_11 obj_29)
   deleted: (pred_11 obj_29)
   added: (pred_8) (pred_1 obj_29 obj_11)
   goals met: 1 of 1
